# Chapter 5 - Cleaning Data

In [2]:
# Basic Libraries

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

import pandas as pd
import numpy as np

### Dataset

The following columns are included in the dataset:

    • pclass - Passenger class (1 = 1st, 2 = 2nd, 3 = 3rd)
    • survival - Survival (0 = No, 1 = Yes)
    • name - Name
    • sex - Sex
    • age - Age
    • sibsp - Number of siblings/spouses aboard
    • parch - Number of parents/children aboard
    • ticket - Ticket number
    • fare - Passenger fare
    • cabin - Cabin
    • embarked - Point of embarkation (C = Cherbourg, Q = Queenstown, S = Southampton)
    • boat - Lifeboat
    • body - Body identification number
    • home.dest - Home/destination

In [5]:
url = ("https://raw.githubusercontent.com/joanby/python-ml-course/refs/heads/master/datasets/titanic/titanic3.csv")
df = pd.read_csv(url)
orig_df = df
orig_df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

### Column Names

When using pandas, having Python-friendly column names
makes attribute access possible. The pyjanitor `clean_names`
function will return a DataFrame with columns in lowercase
and spaces replaced by underscores:

In [9]:
import janitor as jn 

# Create a DataFrame with inconsistent column names and missing values
Xbad = pd.DataFrame(
    {
        "A": [1, None, 3],                       # Column 'A' with a missing value (None) in the second row
        "  sales numbers ": [20.0, 30.0, None],  # Column with extra spaces in the name and a missing value (None) in the third row
    }
)

jn.clean_names(Xbad)  # Use the clean_names() function from janitor to clean the column names by standardizing them

     a  _sales_numbers_
0  1.0             20.0
1  NaN             30.0
2  3.0              NaN

In [10]:
def clean_col(name):  # Define a function that takes a column name as input
    return (
        name.strip().lower().replace(" ", "_")  # Remove leading and trailing spaces, convert to lowercase, and replace spaces with underscores
    )

Xbad.rename(columns=clean_col)  # Rename the columns of the DataFrame using the clean_col function

     a  sales_numbers
0  1.0           20.0
1  NaN           30.0
2  3.0            NaN

### Replacing Missing Values

The `coalesce` function in pyjanitor takes a DataFrame and a
list of columns to consider. This is similar to functionality
found in Excel and SQL databases. It returns the first nonnull
value for each row:

In [14]:
# Used to inspect the function's signature to find the correct parameters:
import inspect
print(inspect.signature(jn.coalesce))

(df: pandas.core.frame.DataFrame, *column_names: Any, target_column_name: Optional[str] = None, default_value: Union[int, float, str, NoneType] = None) -> pandas.core.frame.DataFrame

In [16]:
jn.coalesce(  # Coalesce missing values from the specified columns into a new column
    Xbad,                     # The DataFrame to operate on
    "A", "  sales numbers ",  # Specify the columns to coalesce (no list required, just comma-separated column names)
    target_column_name="val", # Name of the new column that will store the coalesced values
)

     A    sales numbers    val
0  1.0              20.0   1.0
1  NaN              30.0  30.0
2  3.0               NaN   3.0